In [1]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [4]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

#### or we can use def() and apply()

In [6]:
def create_new_column(row):
    return(row['first'] + ' ' +row['last'])

In [7]:
df['full_name'] = df.apply(create_new_column, axis = 1)
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

#### or we can use apply() and lambda()

In [8]:
df['full_name'] = df.apply(lambda row: row['first'] + ' ' + row['last'], axis = 1)
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [9]:
df.drop(columns = ['first', 'last'], inplace = True)

In [10]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [11]:
df['full_name'].str.split(' ', expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [13]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [14]:
df._append({'first': 'Tony'}, ignore_index = True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [15]:
peoplee = {
    "first": ["Roy", "Rox"],
    "last": ["Iron", "Man"],
    "email": ["roy@gmail.com", "iron@email.com"]
}
df2 = pd.DataFrame(peoplee)
df2

  first  last           email
0   Roy  Iron   roy@gmail.com
1   Rox   Man  iron@email.com

##### df._append(df2):

 - df2 will be added below df, but the original indices from both df and df2 will remain unchanged.

 - If both df and df2 have the same index values, there can be duplicate indices.

##### df._append(df2, ignore_index=True):

 - df2 will be added below df, but the index will be reset.

 - The indices will be renumbered starting from 0, 1, 2, ..., ensuring no duplicate indices.

So, with ignore_index=True, the index gets reset to avoid duplicates.

In [16]:
# df._append(df2)
df._append(df2, ignore_index = True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            roy@gmail.com            NaN    Roy     Iron
4           iron@email.com            NaN    Rox      Man

In [17]:
df = df._append(df2, ignore_index = True)

In [18]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            roy@gmail.com            NaN    Roy     Iron
4           iron@email.com            NaN    Rox      Man

In [19]:
df.drop(index = 4, inplace = True)

In [20]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            roy@gmail.com            NaN    Roy     Iron

In [21]:
filt = df['last'] == 'Doe'
df.drop(index = df[filt].index, inplace = True)

In [22]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3            roy@gmail.com            NaN    Roy     Iron